# Задача.
#
# Есть файл с именами (https://yadi.sk/i/97rbNP2ucGoAKw). Нужно выполнить следующие действия и посчитать результат:
#
# 1) Отсортировать все имена в лексикографическом порядке
# 2) Посчитать для каждого имени алфавитную сумму – сумму порядковых номеров букв (MAY: 13 + 1 + 25 = 39)
# 3) Умножить алфавитную сумму каждого имени на порядковый номер имени в отсортированном списке (индексация начинается с 1). Например, если MAY находится на 63 месте в списке, то результат для него будет 63 * 39 = 2457.
# 4) Просуммировать произведения из третьего пункта по всем именам из файла.

# читаем данные из файла names.txt, который лежит рядом с файлом скрипта
with open('names.txt', 'r', encoding='utf-8') as f:
    data_file = f.read()
# подготавливаем список и сортируем его
names = sorted(data_file.replace('"', "").replace("\n", "").split(','))
# считаем произведение суммы порядковых номеров букв в каждом слове на его порядковый номер в списке
# и добавляем накопительным итогом к общей сумме таких произведений в рамках всего списка имен
result = 0
for name in names:
    position_name = names.index(name) + 1
    sum_lit = 0
    for lit in name:
        number_lit = ord(lit) - 64
        sum_lit += number_lit
    result += sum_lit * position_name
# выводим результат в консоль
print(result)

# для данного списка ответ: 871853874

